<a href="https://colab.research.google.com/github/ckkhandare/DS_firstProject/blob/main/DSProject.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Importing Libraries and loading Data

In [22]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder,OneHotEncoder,OrdinalEncoder
from sklearn.model_selection import train_test_split,GridSearchCV,RandomizedSearchCV
from sklearn.impute import SimpleImputer

In [23]:
df=pd.read_csv('train.csv',na_values='unknown')

# Exploratory Data Analysis

In [24]:
df

          ID  age         job   marital  ... pdays previous  poutcome subscribed
0      26110   56      admin.   married  ...    -1        0       NaN         no
1      40576   31         NaN   married  ...    -1        0       NaN         no
2      15320   27    services   married  ...    -1        0       NaN         no
3      43962   57  management  divorced  ...    84        3   success        yes
4      29842   31  technician   married  ...    -1        0       NaN         no
...      ...  ...         ...       ...  ...   ...      ...       ...        ...
31642  36483   29  management    single  ...    -1        0       NaN         no
31643  40178   53  management  divorced  ...    -1        0       NaN        yes
31644  19710   32  management    single  ...    -1        0       NaN         no
31645  38556   57  technician   married  ...   337       12   failure         no
31646  14156   55  management  divorced  ...    -1        0       NaN        yes

[31647 rows x 18 columns]

In [25]:
df.shape

(31647, 18)

In [26]:
df.isnull().sum()*100/31647

ID             0.000000
age            0.000000
job            0.650931
marital        0.000000
education      4.152052
default        0.000000
balance        0.000000
housing        0.000000
loan           0.000000
contact       28.998009
day            0.000000
month          0.000000
duration       0.000000
campaign       0.000000
pdays          0.000000
previous       0.000000
poutcome      81.931937
subscribed     0.000000
dtype: float64

In [27]:
df.select_dtypes(include='O').columns

Index(['job', 'marital', 'education', 'default', 'housing', 'loan', 'contact',
       'month', 'poutcome', 'subscribed'],
      dtype='object')

In [28]:
df.education.unique()

array([nan, 'secondary', 'tertiary', 'primary'], dtype=object)

In [29]:
education=['primary','secondary','tertiary']

In [30]:
ordi=['education']
nomi=['job', 'marital', 'default', 'housing', 'loan', 'contact',
       'month', 'poutcome', 'subscribed']

In [31]:
df.select_dtypes(exclude='O').columns

Index(['ID', 'age', 'balance', 'day', 'duration', 'campaign', 'pdays',
       'previous'],
      dtype='object')

In [32]:
#continuous
continuous=['ID', 'age', 'balance', 'day', 'duration', 'campaign', 'pdays',
       'previous']

#### Observation

poutcome has more than 80% data missing so it can be droped

education is the only ordinal feature rest all as Nominal ['job','marital','default', 'housing','loan', 'contact','month', 'poutcome','subscribed']

job , education and contact have missing values that need to be imputed

In [14]:
sim=SimpleImputer( strategy='most_frequent')

In [15]:
df.isnull().sum().sum()

36626

In [16]:
xyx=sim.fit_transform(df)

In [18]:
xyx=pd.DataFrame(xyx)

In [21]:
xyx

          0   1            2         3          4   ... 13   14  15       16   17
0      26110  56       admin.   married  secondary  ...  2   -1   0  failure   no
1      40576  31  blue-collar   married  secondary  ...  2   -1   0  failure   no
2      15320  27     services   married  secondary  ...  1   -1   0  failure   no
3      43962  57   management  divorced   tertiary  ...  1   84   3  success  yes
4      29842  31   technician   married  secondary  ...  1   -1   0  failure   no
...      ...  ..          ...       ...        ...  ... ..  ...  ..      ...  ...
31642  36483  29   management    single   tertiary  ...  2   -1   0  failure   no
31643  40178  53   management  divorced   tertiary  ...  2   -1   0  failure  yes
31644  19710  32   management    single   tertiary  ...  3   -1   0  failure   no
31645  38556  57   technician   married  secondary  ...  7  337  12  failure   no
31646  14156  55   management  divorced  secondary  ...  2   -1   0  failure  yes

[31647 rows x 18 columns]

In [ ]:
#cross val score
# cl1=logistic()
# cl2=knnclass()
# cl3=svc()
# label=['logistic','knnclass','svc']
# for clf,label in zip([cl1,cl2,cl3],lable):
#   score=cross_val_score(clf,X,y,cv=5,scoring='acciracy')
#   return score.mean()